#GIT-это распределения сиистема контроля версий
#это система для отслеживания и введения истории изменения файлов в нашем проекте. При помошьи GIT можно организвовать командную работу.

# GitHub -вебсайт для размещения git-репозиториев в совместной разработке приектов. Репозиторий - это хранилище нашего кода и истории его изменений 

#Команды Git
# 1. git init создает удаленный репозиторий в той директории в коотрой была прописана команда.
# 2. git add . -кманда для добавления изменений в систему отслеживания гита.(вместо точки можно прописать название директории)
# 3. git commit -m 'something'-это команда для сохранения всех изменений с комментарием к ним.
# 4. git branch .M - это команда переименоввывает главную ветку мвстер на main.
# 5. git remote add origin 'url'- это команда связывает наш локальный репозиторий с удаленным репозиторием на гитхабе.
# 6. git push origin <main> - команда отправки наших  изменений на удаленный репозиторий.
#==========================================================================================================================
# 7. git status - показывает статус репозитория (какие изменения не закомичены).
# 8. git branch - показывает на какой ветке вы находитесь.
